# LinePatternSegment Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinePatternSegment Constructor
LinePatternSegment Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LinePatternSegment()()()() | Creates a line pattern segment. |
| LinePatternSegment(LinePatternSegmentType, Double) | Creates a line pattern segment with given type and length. |

# See Also
LinePatternSegment Class
LinePatternSegment Members
Autodesk.Revit.DB Namespace